-- Добавление пользователей
INSERT INTO "user" (mail, nickname, password, is_moderator, count_checks)
VALUES
('user1@example.com', 'User1', '"03ac674216f3e15c761ee1a5e255f067953623c8b388b4459e13f978d7c846f4"', FALSE, 2),
('user2@example.com', 'User2', '"03ac674216f3e15c761ee1a5e255f067953623c8b388b4459e13f978d7c846f4"', FALSE, 2),
('moderator@example.com', 'ModUser', '"03ac674216f3e15c761ee1a5e255f067953623c8b388b4459e13f978d7c846f4"', TRUE, 2);

-- Добавление вариантов
INSERT INTO variant (variant_text, author_position)
VALUES
('(1)Поэзия начала XIX века, как ничто другое, даёт нам возможность понять события, услышать голоса, интонации людей Двенадцатого года, представить их внутренний духовный облик. (2)Философ Алексей Степанович Хомяков (а он был и поэтом, и историком) говорил: «Нужна поэзия, чтобы узнать историю...»

(З)Но я хочу написать не о литературе, не об истории, а о друзьях и дружестве. (4)О том, что раньше называли «дружескими узами». (5)О том, как эти узы спасали людей в одну из самых драматических эпох всемирной истории.

(6)Многих поэтов 1812 года соединил в «сонм друзей бесценных» Константин Батюшков. (7)Он имел редкий дар сближать людей, сопереживать каждому в радости и горе. (8)Рядом с ним невольно хотелось «нравственно обняться» (так писал в письме своему товарищу Юрий Казаков в конце XX века). (9)«Нравственным братством» назвал батюшковское сообщество литераторов Пётр Вяземский.

(10)Дружбе невозможно научить. (11)Но ещё в детском возрасте можно поддержать, «воспламенить», как говорили в XVIII веке, эту заложенную в человеке способность.

(12)«Любить Отечество и вечно быть друзьями» завещал своим товарищам умерший двадцатилетним Андрей Тургенев. (13)Если бы в 1812 году они остались дома, их никто бы не осудил, но эта завещанная нераздельность двух чувств — любви к Родине и солидарности с друзьями (как же так — они идут воевать, а я останусь в тылу?!) — вела русских поэтов на поля сражений.

(14)13 армейском строю поэты выглядели порой не очень браво: неловкий и вечно простуженный Жуковский, близорукий и мешковатый Вяземский, прихрамывающий и рассеянный Батюшков, собиравший незабудки на поле боя...

(15)Но как ценили поэтов наши генералы! (16)Хотя, казалось бы, куда надёжнее в военное время иметь адъютантом опытного офицера, чёткого профессионала, который не будет витать в облаках. (17)Но генералы упрямо брали в адъютанты мечтательных поэтов.

(18)Под созвездием полководцев служило созвездие поэтов.

(19)В адъютантах у Милорадовича были Пётр Вяземский и Фёдор Глинка.

(20)Рядом с Кутузовым служил Жуковский. (21)Весь Заграничный поход Константин Батюшков прошёл рядом с легендарным генералом Раевским.

(22)Двенадцатый год навсегда остался солнечным сплетением их жизней.

(23)Читая некоторые исследования об отечественной культуре начала XIX века, можно подумать, что литераторы того времени придумали себе «культ дружбы». (24)Будто предполагая такой скептический ход мыслей потомков, Константин Батюшков писал Гнедичу: «Я не знаю ни прозаической, ни поэтической дружбы; я могу просто любить, вот всё, что я знаю...»

(25)В том-то и красота той далёкой эпохи, что дружба лишь в последнюю очередь была явлением литературы.

(26)Дружеские отношения проверил на разрыв, на прочность Двенадцатый год. (27)Дружба русских поэтов была одухотворённым, сердечным теплом. (28)Андрей Кайсаров, первый наш профессор-славист, считал, что только «чувство небесного дружества» и делает народ той или иной страны способным противостоять любым испытаниям.

(29)В своём «Певце во станс русских воинов» Жуковский пишет:
...Блажен, кому Создатель дал
Усладу жизни, друга;
С ним счастье вдвое; в скорбный час
Он сердцу утешенье;
Он наша совесть; он для нас
Второе провиденье.
(30)О! будь же, други, святость уз
Закон наш под шатрами;
Написан кровью наш союз:
И жить и пасть друзьями...

(31)А что для нас стоит за этими стихами? (32)Неужели мы утратили не только этот высокий слог, но и сами чувства, те движения души, которые когда-то составляли главное счастье человеческой жизни?

(33)К счастью, и эпоха Двенадцатого года, и рождённая тогда литература ещё много говорят нам. (34)Мне выпало счастье дружить с людьми, которые живут в нравственных категориях начала XIX века, часто даже и не сознавая этого. (35)Они просто не умеют жить иначе. (36)Вслед за Баратынским они могли бы повторить: «Мы те же сердцем в век иной...»', 'Автор считает, что настоящим поэтом можно назвать того, кто учит людей правильным моральным ценностям, а также создаёт творения, которые способны учить чему-то людей спустя много лет. Данная мысль выражена в конце текста: « К счастью, и эпоха Двенадцатого года, и рождённая тогда литература ещё много говорят нам. Мне выпало счастье дружить с людьми, которые живут в нравственных категориях начала девятнадцатого века, часто даже не осознавая этого».'),
('(1)Солдаты, расположившиеся вокруг пушки, были заняты каждый своим делом. (2)Кто, пристроившись к сосновому ящику со снарядами, писал письмо, слюнявя химический карандаш и сдвинув на затылок шлем; кто сидел на лафете, пришивая к шинели крючок; кто читал маленькую артиллерийскую газету.

(3)Живя с разведчиками и наблюдая поле боя с разных сторон, Ваня привык видеть войну широко и разнообразно. (4)Он привык видеть дороги, леса, болота, мосты, ползущие танки, перебегающую пехоту, минёров, конницу, накапливающуюся в балках…

(5)Ваня стоял у колеса орудия, которое было одной с ним вышины, и рассматривал бумажку, наклеенную на косой орудийный щит. (6)На этой бумажке были крупно написаны тушью какие-то номера и цифры, которые мальчик безуспешно старался прочесть и понять.

– (7)Ну, Ванюша, нравится наше орудие? – услышал он за собой густой, добродушный бас. (8)Мальчик обернулся и увидел наводчика Ковалёва.
– (9)Так точно, товарищ Ковалёв, очень нравится, – быстро ответил Ваня и, вытянувшись в струнку, отдал честь.

(10)Наружностью своей Ковалёв меньше всего отвечал представлению о лихом солдате, Герое Советского Союза, лучшем наводчике фронта. (11)Прежде всего он был немолод. (12)В представлении мальчика он был уже не «дяденька», а скорее принадлежал к категории «дедушек». (13)До войны он был заведующим большой птицеводческой фермой. (14)На фронт он мог не идти, но в первый же день войны записался добровольцем.

(15)Во время Первой мировой войны Ковалёв служил в артиллерии и уже тогда считался выдающимся наводчиком. (16)Вот почему и в эту войну он попросился в артиллерию наводчиком. (17)Сначала в батарее к нему относились с недоверием: уж слишком у него была добродушная, сугубо гражданская внешность. (18)Однако в первом же бою он показал себя таким знатоком своего дела, таким виртуозом, что всякое недоверие кончилось раз и навсегда.

(19)Его работа при орудии была высочайшей степенью искусства. (20)Бывают наводчики хорошие, способные. (21)Бывают наводчики талантливые. (22)Бывают выдающиеся. (23)Он был наводчик гениальный.

(24)И самое удивительное заключалось в том, что за четверть века, которые прошли между двумя мировыми войнами, он не только не утратил своего мастерства, но как-то ещё больше в нём окреп. (25)Новая война поставила артиллерии много новых задач. (26)Она открыла в старом наводчике Ковалёве качества, которые в прежней войне не могли проявиться в полном блеске. (27)Он не имел соперника в стрельбе прямой наводкой.

(28)В минуту опасности Ковалёв преображался. (29)В нём загорался холодный огонь ярости. (30)Он не отступал ни на шаг. (31)Он стрелял из своего орудия до последнего патрона. (32)А истратив последний патрон, он ложился рядом со своим орудием и продолжал стрелять из автомата.

(33)Расстреляв все диски, он спокойно подтаскивал к себе ящики с ручными гранатами и, прищурившись, кидал их одну за другой, пока немцы не отступали…

(34)Среди людей часто попадаются храбрецы. (35)Но только сознательная и страстная любовь к Родине может сделать из храбреца героя.

(36)Ковалёв был истинный герой. (37)Он страстно, но очень спокойно любил Родину и ненавидел всех её врагов.

(38)Командование неоднократно выдвигало Ковалёва на более высокую должность. (39)Но каждый раз он просил оставить его наводчиком и не разлучать с орудием.

– (40)Наводчик – это моё настоящее дело, – говорил Ковалёв, – с другими обязанностями я так хорошо не справлюсь, уж вы мне поверьте, за чинами я не гонюсь. (41)Тогда был наводчиком и теперь до конца войны хочу быть наводчиком. (42)А для командира я уже не гожусь. (43)Стар. (44)Надо молодым давать дорогу. (45)Покорнейше вас прошу.

(46)В конце концов его оставили в покое. (47)Впрочем, может быть, Ковалёв был прав: каждый человек хорош на своём месте. (48)И безусловно, для пользы службы лучше иметь выдающегося наводчика, чем посредственного командира взвода…', 'По мнению автора, внешний вид человека зачастую не соответствует его сущности. По-настоящему личность раскрывается прежде всего в наиболее напряжённые моменты жизни, особенно в экстремальных ситуациях, требующих совершения тех или иных действий. Писатель приводит нас к выводу о том, что судить о человеке нужно именно по его поступкам. Чтобы обосновать позицию автора, обратимся к примерам-иллюстрациям из приведённого текста.'),
('Variant text 3', 'Author Position 3');

-- Добавление эссе
INSERT INTO essay (essay_text, updated_at, status, is_published, user_id, variant_id)
VALUES
('Essay text 1', '2025-01-01 10:00:00', 'draft', FALSE, 1, 1),
('Essay text 2', '2025-01-02 11:00:00', 'saved', TRUE, 2, 2),
('Essay text 3', '2025-01-03 12:00:00', 'checked', TRUE, 3, 3);

-- Добавление комментариев
INSERT INTO comment (user_id, essay_id, comment_text, created_at)
VALUES
(1, 1, 'This is a comment on essay 1', '2025-01-01 10:00:00'),
(2, 2, 'This is a comment on essay 2', '2025-01-01 10:00:00'),
(3, 3, 'This is a comment on essay 3', '2025-01-01 10:00:00');

-- Добавление лайков
INSERT INTO "like" (user_id, essay_id)
VALUES
(1, 2),
(2, 3),
(3, 1);

-- Добавление результатов
INSERT INTO result (sum_score, essay_id)
VALUES
(22, 1),
(22, 2),
(18, 3);

-- Добавление критериев
INSERT INTO criteria (title)
VALUES
('Отражение позицииавтора (рассказчика) по указанной проблеме исходного текста'),
('Комментарий к позиции автора (рассказчика) по указанной проблеме исходного текста'),
('Собственное отношение к позиции автора (рассказчика) по указанной проблеме исходного текста'),
('Фактическая точность речи'),
('Логичность речи'),
('Соблюдение этических норм'),
('Соблюдение орфографических норм'),
('Соблюдение пунктуационных норм'),
('Соблюдение грамматических норм'),
('Соблюдение речевых норм');

-- Добавление результатов по критериям
INSERT INTO result_criteria (result_id, criteria_id, score)
VALUES
(1, 1, 1),
(1, 2, 3),
(1, 3, 2),
(2, 1, 1),
(2, 2, 3),
(2, 3, 2),
(3, 1, 1),
(3, 2, 2),
(3, 3, 2);
